Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Lengths counted in UTF-16 units: %@
fr: Longueurs comptées en unités UTF-16 : %@

source: The color marks this connection in the connection list and its window.
fr: La couleur marque cette connexion dans la liste des connexions et dans sa fenêtre.

source: Compared %@ keys in key order. Rows past the limit were not read on either side, and rows with NULL in a key column are not read under a limit.
fr: Compare les clés %@ dans l'ordre des clés. Les lignes dépassant la limite n'ont pas été lues des deux côtés, et les lignes contenant NULL dans une colonne clé ne sont pas lues en dessous d'une limite.

# %@ must be %lld characters or less
source: %1$@ must be %2$lld characters or less
fr: %1$@ doit être composé de %2$lld caractères ou moins.
ko: %1$@ 길이는 %2$lld자 이하여야 합니다
tr: %@ must be %lld karakter or az
vi: %1$@ phải có %2$lld ký tự trở xuống
zh_hans: %@ 必须为 %lld 个字符或更少
zh_hant: %1$@ 不能超過 %2$lld 個字

source: Restore from
fr: Restaurer depuis
ko: 다음에서 복원
tr: Geri yükleme kaynağı
vi: Khôi phục từ
zh_hans: 恢复来源
zh_hant: 還原來源

source: Transfer completed with warnings
fr: Transfert terminé avec des avertissements

source: Writes 1 file with %1$lld of %2$lld %3$@.
fr: Écrit 1 fichier avec %1$lld de %2$lld %3$@.

source: No Users or Roles
fr: Aucun utilisateur ou rôle
ko: 사용자 또는 역할 없음
tr: Kullanıcı veya Rol Yok
vi: Không có người dùng hoặc vai trò
zh_hans: 没有用户或角色
zh_hant: 沒有使用者或角色

source: Matching is case-sensitive
fr: La correspondance est sensible à la casse.
ko: 일치 시 대/소문자 구분
tr: Eşleştirme büyük/küçük harfe duyarlı
vi: So khớp phân biệt hoa thường
zh_hans: 匹配时区分大小写
zh_hant: 比對時區分大小寫

source: Install Plugin
fr: Installer un plugin
ko: 플러그인 설치
tr: Eklentiyi Yükle
vi: Cài đặt Plugin
zh_hans: 安装插件
zh_hant: 安裝外掛

source: Cannot save the new row in '%1$@'. %2$@
fr: Impossible d'enregistrer la nouvelle ligne dans '%1$@'. %2$@

source: No Datasets
fr: Aucun ensemble de données
ko: 데이터세트 없음
tr: Veri Kümesi Yok
vi: Không có dataset
zh_hans: 没有数据集
zh_hant: 沒有資料集

source: Drop %@…
fr: Déposer %@...
ko: %@ 삭제…
tr: %@ Bırak…
vi: Xóa %@…
zh_hans: 删除 %@…
zh_hant: 刪除 %@…

source: Upgrade Plan
fr: Plan de mise à niveau
ko: 요금제 업그레이드
tr: Planı Yükselt
vi: Nâng cấp gói
zh_hans: 升级方案
zh_hant: 升級方案

source: Runs a command you write. It must open the local port itself.
fr: Exécute une commande que vous écrivez. Il doit ouvrir lui-même le port local.

source: Auto-indent
fr: Indentation automatique
ko: 자동 들여쓰기
tr: Otomatik girinti
vi: Tự động thụt lề
zh_hans: 自动缩进
zh_hant: 自動縮排

source: MEDIUM
fr: Moyen
ko: 중간
tr: ORTA
vi: TRUNG BÌNH
zh_hans: 中等
zh_hant: 中等

source: Rule column
fr: Colonne de règle

source: AWS SSO Sign-In Required
fr: Connexion SSO AWS requise
ko: AWS SSO 로그인 필요
tr: AWS SSO ile oturum açma gerekli
vi: Yêu cầu đăng nhập AWS SSO
zh_hans: 需要AWS SSO登录
zh_hant: 需要 AWS SSO 登入

source: Whether the count is an estimate
fr: Que le compte soit une estimation ou non
ko: 행 수가 추정치인지 여부
tr: Sayının bir tahmin olup olmadığı
vi: Con số đó có phải ước lượng hay không
zh_hans: 该计数是否为估算值
zh_hant: 該計數是否為估算值

source: Attachments
fr: Pièces jointes
ko: 첨부 파일
tr: Ekler
vi: Tệp đính kèm
zh_hans: 附件
zh_hant: 附件

source: Leave blank to use the global %d-second timeout. This setting applies only to database drivers that support it.
fr: Laissez vide pour utiliser le délai d'attente global de %d secondes. Cette configuration ne s'applique qu'aux pilotes de base de données qui le prennent en charge.

source: Scroll them
fr: Faites défiler-les

source: All tokens
fr: Tous les jetons
ko: 모든 토큰
tr: Tüm token'lar
vi: Tất cả token
zh_hans: 所有令牌
zh_hant: 所有權杖

source: Read saved passwords from Keychain (requires permission)
fr: Lire les mots de passe enregistrés dans le portefeuille (exige l'autorisation)
ko: 키체인에서 저장된 암호 읽기(권한 필요)
tr: Keychain'den kayıtlı parolaları oku (izin gerektirir)
vi: Đọc mật khẩu đã lưu từ Keychain (cần quyền)
zh_hans: 从钥匙串读取已保存的密码（需要权限）
zh_hant: 從鑰匙圈讀取已儲存的密碼（需要權限）

source: Fix the last error on the current query
fr: Corriger la dernière erreur sur la requête actuelle.
ko: 현재 쿼리의 마지막 오류 수정
tr: Geçerli sorgudaki son hatayı düzelt
vi: Sửa lỗi gần nhất của truy vấn hiện tại
zh_hans: 修复当前查询的最后一个错误
zh_hant: 修正目前查詢的最後一個錯誤

source: This connection has no tunnel command to run.
fr: Cette connexion n'a pas de commande de tunnel à exécuter.

source: a destructive statement
fr: Une déclaration destructrice
ko: 파괴적인 명령문
tr: yıkıcı bir ifade
vi: một câu lệnh có tính phá huỷ
zh_hans: 一条破坏性语句
zh_hant: 一條破壞性陳述式

source: Storage engine change
fr: Changement du moteur de stockage
ko: 스토리지 엔진 변경
tr: Depolama motoru değişikliği
vi: Thay đổi storage engine
zh_hans: 存储引擎更改
zh_hant: 儲存引擎變更

source: Cannot delete rows in '%@'. Some rows could not be identified.
fr: Impossible de supprimer des lignes dans '%@'. Certaines lignes n'ont pas pu être identifiées.
ko: '%@'의 행을 삭제할 수 없습니다. 일부 행을 식별할 수 없습니다.
tr: '%@' içindeki satırlar silinemiyor. Bazı satırlar tanımlanamadı.
vi: Không thể xoá dòng trong '%@'. Một số dòng không xác định được.
zh_hans: 无法删除 '%@' 中的行。有些行无法被识别。
zh_hant: 無法刪除 '%@' 中的列。有些列無法被識別。

source: No changes to preview
fr: Aucune modification à la vue d'aperçu
ko: 미리 볼 변경 사항 없음
vi: Không có thay đổi để xem trước
zh_hans: 无可预览的更改
zh_hant: 沒有可預覽的變更

source: Set as Active
fr: Définir comme actif
ko: 활성으로 설정
tr: Aktif Olarak Ayarla
vi: Đặt làm đang hoạt động
zh_hans: 设为活动
zh_hant: 設為使用中

source: %@ does not allow NULL, so its default cannot be NULL
fr: %@ ne permet pas NULL, donc sa valeur par défaut ne peut pas être NULL.

source: No Node Selected
fr: Aucun nœud sélectionné
ko: 선택된 노드 없음
tr: Düğüm Seçilmedi
vi: Chưa chọn nút
zh_hans: 未选择节点
zh_hant: 未選擇節點

source: Export Data
fr: Exportation de données
ko: 데이터 내보내기
tr: Veriyi Dışa Aktar
vi: Xuất dữ liệu
zh_hans: 导出数据
zh_hant: 匯出資料

source: Filtered
fr: Filtré
ko: 필터링됨
tr: Filtrelendi
vi: Đã lọc
zh_hans: 已筛选
zh_hant: 已篩選

source: The CREATE statement for one table, as the engine reports it.
fr: L'instruction CREATE pour une table, telle que le moteur le rapporte.
ko: 엔진이 보고하는 그대로의, 한 테이블에 대한 CREATE 명령문입니다.
tr: Motorun bildirdiği şekliyle bir tablo için CREATE ifadesi.
vi: Câu lệnh CREATE cho một bảng, đúng như engine báo cáo.
zh_hans: 某张表的 CREATE 语句，按引擎报告的原样。
zh_hant: 某張資料表的 CREATE 陳述式，按引擎回報的原樣。

source: TablePro takes no funding and sells no data. If you want to do more, sponsorship goes to the same place.
fr: TablePro ne reçoit aucun financement et ne vend aucun donnée. Si vous voulez faire plus, le parrainage va au même endroit.
ko: TablePro는 투자를 받지 않고 데이터를 팔지 않습니다. 더 보태고 싶다면 후원도 같은 곳으로 갑니다.
tr: TablePro yatırım almaz ve veri satmaz. Daha fazlasını yapmak isterseniz, sponsorluk da aynı yere gider.
vi: TablePro không nhận vốn đầu tư và không bán dữ liệu. Nếu bạn muốn góp thêm, tài trợ cũng đi về cùng một nơi.
zh_hans: TablePro 不接受投资，也不出售数据。如果你想多做一点，赞助也流向同一个地方。
zh_hant: TablePro 不接受投資，也不出售資料。如果你想多做一點，贊助也流向同一個地方。

source: Redacted failure text
fr: Texte d'échec supprimé
ko: 편집된 실패 텍스트
tr: Maskelenmiş hata metni
vi: Nội dung lỗi đã lược bỏ thông tin nhạy cảm
zh_hans: 经过脱敏的失败文本
zh_hant: 經過去識別化的失敗文字

source: Filter rows
fr: Filtrer les lignes

source: the target
fr: La cible
ko: 대상
tr: hedef
vi: đích
zh_hans: 目标
zh_hant: 目標

source: Could not build the table rebuild for this change. If this engine's driver was installed before foreign key editing shipped, update it in Settings > Plugins.
fr: Impossible de reconstruire la table pour ce changement. Si le pilote de ce moteur a été installé avant l'expédition de la modification de la clé étrangère, veuillez le mettre à jour dans Paramètres > Plugins.

source: Pre-connect script failed (exit %lld): %@
fr: Échec du script de pré-connexion (sortir %lld) : %@
ko: 연결 전 스크립트 실패(종료 코드 %lld): %@
vi: Script pre-connect thất bại (exit %lld): %@
zh_hans: 连接前脚本失败（退出码 %lld）：%@
zh_hant: 連線前指令稿失敗（退出碼 %lld）：%@

source: Setup Instructions
fr: Instructions de configuration
ko: 설정 지침
tr: Kurulum Talimatları
vi: Hướng dẫn thiết lập
zh_hans: 设置说明
zh_hant: 設定說明

source: Match what I type, otherwise UPPERCASE
fr: Correspondre à ce que j'écris, sinon EN MAJUSCULES

source: Quick search across all columns...
fr: Recherche rapide dans toutes les colonnes...
ko: 모든 열에서 빠르게 검색...
vi: Tìm kiếm nhanh trên tất cả các cột...
zh_hans: 快速搜索所有列...
zh_hant: 在所有欄位中快速搜尋…

source: Clear All Value Filters
fr: Effacer tous les filtres de valeur
ko: 모든 값 필터 지우기
tr: Tüm Değer Filtrelerini Temizle
vi: Xóa tất cả bộ lọc giá trị
zh_hans: 清除所有值筛选
zh_hant: 清除所有值篩選

source: Match Columns
fr: Correspondance des colonnes

source: Disconnected
fr: Décousu
ko: 연결이 해제되었습니다
tr: Bağlantı Kesildi
vi: Đã ngắt kết nối
zh_hans: 已断开连接
zh_hant: 已中斷連線

source: Add Element
fr: Ajouter un élément
ko: 요소 추가
tr: Öğe Ekle
vi: Thêm phần tử
zh_hans: 添加元素
zh_hant: 加入元素

source: The target driver cannot be written to.
fr: Le lecteur cible ne peut pas être écrit.

source: ON DELETE action
fr: Action SUR SUPPRESSION
ko: ON DELETE 동작
tr: ON DELETE eylemi
vi: Hành vi ON DELETE
zh_hans: ON DELETE 动作
zh_hant: ON DELETE 動作

source: Jump host key not found: %@
fr: Clé d'hôte de saut non trouvée : %@
ko: 점프 호스트 키를 찾을 수 없습니다: %@
tr: Atlama sunucusu anahtarı bulunamadı: %@
vi: Không tìm thấy khóa của jump host: %@
zh_hans: 未找到跳板主机密钥：%@
zh_hant: 找不到跳板主機金鑰：%@

source: Not generated
fr: Non généré
ko: 생성되지 않음
tr: Üretilmedi
vi: Không được tạo
zh_hans: 未生成
zh_hant: 未產生

source: Use % to allow any host.
fr: % to Utilisezour autoriser n'importe quel hôte.
ko: 모든 호스트를 허용하려면 %를 사용하십시오.
tr: Herhangi bir sunucuya izin vermek için % kullanın.
vi: Dùng % để cho phép mọi máy chủ.
zh_hans: 使用 % 表示允许任意主机。
zh_hant: 使用 % 表示允許任何主機。

source: INSERT, UPDATE, or DELETE
fr: INSÉRER, MISE À JOUR, OU SUPPRIMER
ko: INSERT, UPDATE 또는 DELETE
tr: INSERT, UPDATE veya DELETE
vi: INSERT, UPDATE hoặc DELETE
zh_hans: INSERT、UPDATE 或 DELETE
zh_hant: INSERT、UPDATE 或 DELETE

source: This deletes only the queries listed here, across every connection. Queries the source, date, outcome and search filters are hiding stay. You cannot undo this.
fr: Cela supprime uniquement les requêtes énumérées ici, sur toutes les connexions. Les requêtes qui cachent la source, la date, le résultat et les filtres de recherche restent inchangées. Vous ne pouvez pas annuler cela.
ko: 여기에 나열된 쿼리만 모든 연결에서 삭제합니다. 소스, 날짜, 결과 및 검색 필터로 숨겨진 쿼리는 유지됩니다. 이 작업은 실행 취소할 수 없습니다.
tr: Bu, yalnızca burada listelenen sorguları tüm bağlantılarda siler. Kaynak, tarih, sonuç ve arama filtrelerinin gizlediği sorgular kalır. Bu işlem geri alınamaz.
vi: Thao tác này chỉ xoá các truy vấn được liệt kê ở đây, trên mọi kết nối. Các truy vấn đang bị bộ lọc nguồn, ngày, kết quả và tìm kiếm ẩn đi sẽ được giữ lại. Bạn không thể hoàn tác.
zh_hans: 这只会删除此处列出的查询，涵盖所有连接。被来源、日期、结果和搜索筛选隐藏的查询会保留。此操作无法撤销。
zh_hant: 這只會刪除此處列出的查詢，涵蓋所有連線。被來源、日期、結果和搜尋篩選隱藏的查詢會保留。此動作無法復原。

source: No compatible build is available yet. This plugin will update automatically once one is published.
fr: Aucune version compatible n'est encore disponible. Ce plugin sera mis à jour automatiquement une fois qu'une version sera publiée.
ko: 호환되는 빌드를 아직 사용할 수 없습니다. 빌드가 게시되면 이 플러그인이 자동으로 업데이트됩니다.
tr: Henüz uyumlu bir derleme yok. Yayımlandığında bu eklenti otomatik olarak güncellenecek.
vi: Chưa có bản dựng tương thích. Plugin này sẽ tự động cập nhật khi có bản mới được phát hành.
zh_hans: 目前还没有兼容的构建版本。发布后此插件将自动更新。
zh_hant: 目前還沒有相容的建置版本。發布後此外掛將自動更新。

# iCloud rejected %d change(s). They stay on this device and will retry: %@
source: iCloud rejected %1$d change(s). They stay on this device and will retry: %2$@
fr: iCloud a rejeté %1$d changement(s). Ils restent sur cet appareil et réessayeront : %2$@
ko: iCloud에서 변경 사항 %d개를 거부했습니다. 변경 사항은 이 기기에 유지되며 다시 시도됩니다: %@
tr: iCloud %1$d değişikliği reddetti. Bunlar bu cihazda kalır ve yeniden denenir: %2$@
vi: iCloud đã từ chối %1$d thay đổi. Chúng vẫn ở trên thiết bị này và sẽ thử lại: %2$@
zh_hans: iCloud 拒绝了 %1$d 项更改。它们保留在本设备上，稍后会重试：%2$@
zh_hant: iCloud 拒絕了 %1$d 項變更。它們保留在本裝置上，稍後會重試：%2$@

source: Not Connected
fr: Non connecté

source: Toggle Connections
fr: Changer les connexions
ko: 연결 표시/숨기기
tr: Bağlantıları Aç/Kapat
vi: Bật/tắt kết nối
zh_hans: 切换连接
zh_hant: 切換連線

source: %@ duplicate rows
fr: %@ lignes de doublon

source: Delete Favorite?
fr: Supprimer Favoris ?
ko: 즐겨찾기를 삭제하시겠습니까?
tr: Favoriyi Sil?
vi: Xoá mục yêu thích?
zh_hans: 删除收藏？
zh_hant: 刪除我的最愛？

source: Remove Failed
fr: Suppression échouée
ko: 제거 실패
tr: Kaldırma Başarısız
vi: Gỡ thất bại
zh_hans: 移除失败
zh_hant: 移除失敗

source: Open in New Tab
fr: Ouvrir dans un nouvel onglet
ko: 새 탭에서 열기
tr: Yeni Sekmede Aç
vi: Mở trong tab mới
zh_hans: 在新标签页中打开
zh_hant: 在新分頁中開啟

source: Server Dashboard
fr: Cadre de contrôle du serveur
ko: 서버 대시보드
tr: Sunucu Panosu
vi: Bảng điều khiển máy chủ
zh_hans: 服务器仪表盘
zh_hant: 伺服器儀表板

source: Submit Another
fr: Envoyez un autre
ko: 다른 항목 제출
tr: Bir Tane Daha Gönder
vi: Gửi tiếp
zh_hans: 提交另一个
zh_hant: 再提交一筆

source: Add indexes to improve query performance on frequently searched columns
fr: Ajoutez des index pour améliorer les performances des requêtes sur les colonnes fréquemment recherchées.
ko: 자주 검색하는 열의 쿼리 성능을 높이려면 인덱스를 추가하십시오
tr: Sık aranan sütunlarda sorgu performansını artırmak için indeks ekleyin
vi: Thêm chỉ mục để cải thiện hiệu suất truy vấn trên các cột thường xuyên tìm kiếm
zh_hans: 添加索引以提升常用搜索列的查询性能
zh_hant: 為常搜尋的欄位新增索引以提升查詢效能

source: Could not export the theme
fr: Impossible d'exporter le thème
ko: 테마를 내보낼 수 없습니다
tr: Tema dışa aktarılamadı
vi: Không thể xuất giao diện
zh_hans: 无法导出主题
zh_hant: 無法匯出佈景主題

source: Wrap each table in a transaction
fr: Enveloppez chaque table dans une transaction

source: Turn a described schema change into migration statements plus the rollback, for this engine
fr: Transforme un changement de schéma décrit en déclarations de migration plus le rétrogradation, pour ce moteur.
ko: 설명된 스키마 변경을 이 엔진에 맞는 마이그레이션 명령문과 롤백으로 바꿉니다
tr: Anlatılan bir şema değişikliğini, bu motor için geçiş ifadelerine ve geri alma adımına dönüştürür
vi: Biến một thay đổi schema được mô tả thành các câu lệnh migration kèm bước rollback, cho engine này
zh_hans: 把描述出来的 Schema 变更转换为针对该引擎的迁移语句以及回滚语句
zh_hant: 把描述出來的綱要變更轉換為針對該引擎的遷移陳述式以及回復陳述式

source: Detach
fr: Détacher
ko: 분리
tr: Ayır
vi: Tách rời
zh_hans: 分离
zh_hant: 分離

source: Text Encoding:
fr: Encodage du texte :

source: Primary Text
fr: Texte primaire
ko: 기본 텍스트
tr: Birincil Metin
vi: Văn bản chính
zh_hans: 主要文本
zh_hant: 主要文字

source: Fetching models…
fr: Chargement des modèles...
ko: 모델 가져오는 중…
tr: Modeller alınıyor…
vi: Đang lấy danh sách model…
zh_hans: 正在获取模型…
zh_hant: 正在擷取模型…

source: Stop trusting this developer?
fr: Arrêtez de faire confiance à ce développeur ?
ko: 이 개발자에 대한 신뢰를 해제하시겠습니까?
tr: Bu geliştiriciye güven kaldırılsın mı?
vi: Ngừng tin cậy nhà phát triển này?
zh_hans: 停止信任此开发者？
zh_hant: 要停止信任此開發者嗎？

source: The key that protects your save history is not available.
fr: La clé qui protège votre historique de sauvegarde n'est pas disponible.
ko: 저장 기록을 보호하는 키를 사용할 수 없습니다.
tr: Kaydetme geçmişinizi koruyan anahtar kullanılamıyor.
vi: Khoá bảo vệ lịch sử lưu của bạn hiện không khả dụng.
zh_hans: 保护你保存历史的密钥不可用。
zh_hant: 保護你儲存記錄的金鑰無法使用。

source: No database connection
fr: Pas de connexion à la base de données
ko: 데이터베이스 연결 없음
tr: Veritabanı bağlantısı yok
vi: Chưa kết nối cơ sở dữ liệu
zh_hans: 未连接数据库
zh_hant: 未連線資料庫

source: Name a new database file, created when you connect
fr: Nommez un nouveau fichier de base de données, créé lorsque vous vous connectez.

source: Inside an array
fr: À l'intérieur d'un tableau
ko: 배열 내부
tr: Bir dizinin içinde
vi: Bên trong một mảng
zh_hans: 在数组内
zh_hant: 在陣列內

source: Renew
fr: Renouveler
ko: 갱신
tr: Yenile
vi: Gia hạn
zh_hans: 续期
zh_hant: 續訂

source: Swap Source and Target
fr: Échanger la source et la cible
ko: 원본과 대상 바꾸기
tr: Kaynak ve Hedefi Değiştir
vi: Hoán đổi nguồn và đích
zh_hans: 互换来源和目标
zh_hant: 互換來源和目標

source: Insert Column After
fr: Insérer la colonne après
ko: 뒤에 열 삽입
tr: Sonrasına Sütun Ekle
vi: Chèn cột sau
zh_hans: 在后面插入列
zh_hant: 在後方插入欄位

source: C++ rewrite of Cassandra, faster
fr: Réécriture de Cassandra en C++, plus rapide
ko: Cassandra를 C++로 재작성한 더 빠른 데이터베이스
tr: Cassandra'nın C++ ile yeniden yazımı, daha hızlı
vi: Bản viết lại Cassandra bằng C++, nhanh hơn
zh_hans: Cassandra的C++重写版，速度更快
zh_hant: Cassandra 的 C++ 重寫版，速度更快

source: Sync connections, settings, and history across your Macs.
fr: Synchronisez les connexions, les paramètres et l'historique sur tous vos Macs.
ko: Mac 간에 연결, 설정 및 기록을 동기화합니다.
vi: Đồng bộ kết nối, cài đặt và lịch sử giữa các máy Mac.
zh_hans: 在多台 Mac 之间同步连接、设置和历史记录。
zh_hant: 在你的多台 Mac 之間同步連線、設定與歷程記錄。

source: Sort and filter connections
fr: Classer et filtrer les connexions

source: Index Size
fr: Taille de l'indice
ko: 인덱스 크기
tr: İndeks Boyutu
vi: Kích thước chỉ mục
zh_hans: 索引大小
zh_hant: 索引大小

source: Loading options…
fr: Chargement des options...
ko: 옵션 불러오는 중…
tr: Seçenekler yükleniyor…
vi: Đang tải tùy chọn…
zh_hans: 正在载入选项…
zh_hant: 正在載入選項…

source: Unknown explain variant '%@'.
fr: Variante '%@' inconnue expliquée.
ko: 알 수 없는 EXPLAIN 변형 '%@'입니다.
tr: Bilinmeyen açıklama varyantı '%@'.
vi: Biến thể EXPLAIN không xác định '%@'.
zh_hans: 未知的 EXPLAIN 变体 '%@'。
zh_hant: 未知的 EXPLAIN 變體 '%@'。

source: Saved Query
fr: Requête enregistrée
ko: 저장된 쿼리
tr: Kaydedilmiş Sorgu
vi: Truy vấn đã lưu
zh_hans: 已保存的查询
zh_hant: 已儲存的查詢

source: Current %1$@: %2$@
fr: Pourcentage actuel %1$@ : %2$@
ko: 현재 %1$@: %2$@
tr: Geçerli %1$@: %2$@
vi: %1$@ hiện tại: %2$@
zh_hans: 当前 %1$@：%2$@
zh_hant: 目前 %1$@：%2$@

source: Close Other Results
fr: Fermer d'autres résultats

source: List Partitions
fr: Liste des partitions
ko: 파티션 목록
tr: Bölümleri Listele
vi: Liệt kê phân vùng
zh_hans: 列出分区
zh_hant: 列出分割區

source: Table name, or 'query'
fr: Nom de la table, ou "requête"
ko: 테이블 이름 또는 'query'
tr: Tablo adı veya 'query'
vi: Tên bảng, hoặc 'query'
zh_hans: 表名，或 'query'
zh_hant: 資料表名稱，或 'query'

source: Publish saved queries to your team?
fr: Publier les requêtes enregistrées à votre équipe ?
ko: 저장된 쿼리를 팀에 게시하시겠습니까?
tr: Kayıtlı sorgular takımınıza yayınlansın mı?
vi: Xuất bản các truy vấn đã lưu cho nhóm của bạn?
zh_hans: 要将已保存的查询发布给团队吗？
zh_hant: 要將已儲存的查詢發佈給團隊嗎？

source: The license text is missing from this build.
fr: Le texte de la licence est manquant dans cette version.
ko: 이 빌드에는 라이선스 본문이 없습니다.
tr: Lisans metni bu derlemede yok.
vi: Bản dựng này thiếu nội dung giấy phép.
zh_hans: 此版本缺少许可证文本。
zh_hant: 此版本缺少授權條款文字。

source: Put the credential in the Token field, not in the address.
fr: Mettez la pièce jointe dans le champ Token, pas dans l'adresse.

source: Regular Expression
fr: Expression régulière

source: %@ cells
fr: %@ cellules

source: Keyword:
fr: Mot-clé :
ko: 키워드:
tr: Anahtar Kelime:
vi: Từ khoá:
zh_hans: 关键字：
zh_hant: 關鍵字:

source: Unused
fr: Inutilisé

source: Invalid username or password
fr: Nom d'utilisateur ou mot de passe invalide
ko: 사용자 이름 또는 암호가 올바르지 않습니다
tr: Geçersiz kullanıcı adı veya parola
vi: Tên đăng nhập hoặc mật khẩu không hợp lệ
zh_hans: 用户名或密码无效
zh_hant: 使用者名稱或密碼無效

source: No databases match "%@"
fr: Aucune base de données ne correspond à "%@"
ko: "%@"과 일치하는 데이터베이스 없음
vi: Không có cơ sở dữ liệu nào khớp "%@"
zh_hans: 没有匹配 "%@" 的数据库
zh_hant: 沒有符合「%@」的資料庫

source: Available once the view is populated. Refresh it once without this option first.
fr: Disponible une fois que la vue est remplie. Récupérez-la une fois sans cette option d'abord.

source: Duplicate Filter
fr: Filtre de duplication
ko: 필터 복제
tr: Filtreyi Çoğalt
vi: Nhân bản bộ lọc
zh_hans: 复制筛选条件
zh_hant: 複製篩選條件

source: Focus Query Tab
fr: Fichier de la barre de recherche de focus
ko: 쿼리 탭에 포커스
tr: Sorgu Sekmesine Odaklan
vi: Chuyển đến tab truy vấn
zh_hans: 聚焦查询标签页
zh_hant: 聚焦查詢分頁

source: not contains
fr: Ne contient pas
ko: 포함하지 않음
tr: içermez
vi: không chứa
zh_hans: 不包含
zh_hant: 不包含

source: This Connection
fr: Cette connexion
ko: 이 연결
tr: Bu Bağlantı
vi: Kết nối này
zh_hans: 此连接
zh_hant: 此連線

source: No Extensions
fr: Pas d'extensions

source: Import Without Commands
fr: Importation sans commandes

source: percent sign
fr: Point de pourcentage
ko: 퍼센트 기호
tr: yüzde işareti
vi: dấu phần trăm
zh_hans: 百分号
zh_hant: 百分比符號

source: Row data size
fr: Taille des données de la ligne
ko: 행 데이터 크기
tr: Satır veri boyutu
vi: Kích thước dữ liệu dòng
zh_hans: 行数据大小
zh_hant: 列資料大小

source: Line ending
fr: Fin de ligne
ko: 줄 끝
tr: Satır sonu
vi: Ký tự xuống dòng
zh_hans: 换行符
zh_hant: 換行字元

source: Testing
fr: Tests
ko: 테스트
tr: Test
vi: Kiểm thử
zh_hans: 测试
zh_hant: 測試

source: cloudflared was not found. Set its path below first.
fr: cloudflared n'a pas été trouvé. Définissez d'abord son chemin ci-dessous.
ko: cloudflared를 찾을 수 없습니다. 먼저 아래에서 경로를 설정하십시오.
tr: cloudflared bulunamadı. Önce aşağıda yolunu belirtin.
vi: Không tìm thấy cloudflared. Hãy đặt đường dẫn bên dưới trước.
zh_hans: 未找到cloudflared。请先在下方设置其路径。
zh_hant: 找不到 cloudflared。請先在下方設定其路徑。

source: A Cloudflare tunnel already exists for connection: %@
fr: Un tunnel Cloudflare existe déjà pour la connexion : %@
ko: %@ 연결에 대한 Cloudflare 터널이 이미 있습니다.
tr: Bu bağlantı için zaten bir Cloudflare tüneli var: %@
vi: Đã có Cloudflare tunnel cho kết nối: %@
zh_hans: 该连接已存在Cloudflare隧道：%@
zh_hant: 這個連線已存在 Cloudflare 隧道：%@

source: Allowed values
fr: Valeurs autorisées
ko: 허용되는 값
tr: İzin verilen değerler
vi: Giá trị được phép
zh_hans: 允许的值
zh_hant: 允許的值

source: Could not generate SQL for '%@'.
fr: Impossible de générer SQL pour '%@'.
ko: '%@'에 대한 SQL을 생성할 수 없습니다.
tr: '%@' için SQL üretilemedi.
vi: Không tạo được SQL cho '%@'.
zh_hans: 无法为 '%@' 生成 SQL。
zh_hant: 無法為 '%@' 產生 SQL。

source: Diff layout
fr: Cadre différent
ko: 차이 비교 레이아웃
tr: Fark düzeni
vi: Bố cục so sánh
zh_hans: 差异布局
zh_hant: 差異版面

source: Saved Queries:
fr: Requêtes enregistrées :
ko: 저장된 쿼리:
tr: Kayıtlı Sorgular:
vi: Truy vấn đã lưu:
zh_hans: 已保存的查询：
zh_hant: 已儲存的查詢：

source: Backup Dump Cancelled
fr: Dépôt de sauvegarde annulé
ko: 백업 덤프 취소됨
tr: Yedek dökümü iptal edildi
vi: Đã hủy dump sao lưu
zh_hans: 备份转储已取消
zh_hant: 資料庫備份已取消

source: Operation Failed
fr: Opération échouée
ko: 작업 실패
tr: İşlem Başarısız
vi: Thao tác thất bại
zh_hans: 操作失败
zh_hant: 操作失敗

source: Run the command below in your terminal
fr: Exécutez la commande ci-dessous dans votre terminal.
ko: 터미널에서 아래 명령을 실행하십시오
tr: Aşağıdaki komutu terminalinizde çalıştırın
vi: Chạy lệnh dưới đây trong terminal
zh_hans: 在终端中运行以下命令
zh_hant: 在終端機中執行以下指令

source: Ready after restart
fr: Prêt après redémarrage
ko: 재시작 후 사용 가능
tr: Yeniden başlattıktan sonra hazır
vi: Sẵn sàng sau khi khởi động lại
zh_hans: 重启后可用
zh_hant: 重新啟動後可用

source: %lld-%lld of %lld ^[rows](inflect: true)
fr: %lld-%lld de %lld ^[rows](inflect: true)
ko: %1$lld-%2$lld / %3$lld행
tr: %lld-%lld / %lld satır
vi: %lld-%lld trên %lld dòng
zh_hans: %lld-%lld / %lld行
zh_hant: %1$lld-%2$lld / %3$lld 列

source: No matching objects
fr: Aucun objet correspondant
ko: 일치하는 객체 없음
vi: Không tìm thấy đối tượng phù hợp
zh_hans: 没有匹配的对象
zh_hant: 沒有符合的物件

source: Enable preview tabs
fr: Activer les onglets d'aperçu
ko: 미리보기 탭 활성화
tr: Önizleme sekmelerini etkinleştir
vi: Bật tab xem trước
zh_hans: 启用预览标签页
zh_hant: 啟用預覽分頁

source: Always 'focused' on success
fr: Toujours "concentré" sur le succès
ko: 성공 시 항상 'focused'
tr: Başarılı olduğunda her zaman 'focused'
vi: Luôn là 'focused' khi thành công
zh_hans: 成功时始终为 'focused'
zh_hant: 成功時一律為 'focused'

# Current %@: %@ (read only, ⌘K to %@)
source: Current %1$@: %2$@ (read only, ⌘K to %3$@)
fr: %1$@ actuel : %2$@ (lecture seule, ⌘K pour %3$@)
ko: 현재 %1$@: %2$@ (읽기 전용, ⌘K로 %3$@)
tr: Geçerli %1$@: %2$@ (salt okunur, %3$@ için ⌘K)
vi: %1$@ hiện tại: %2$@ (chỉ đọc, ⌘K để %3$@)
zh_hans: 当前%1$@：%2$@（只读，⌘K 可%3$@）
zh_hant: 目前的 %1$@：%2$@（唯讀，⌘K 可%3$@）

source: Column names must be unique.
fr: Les noms des colonnes doivent être uniques.
ko: 열 이름은 고유해야 합니다.
tr: Sütun adları benzersiz olmalıdır.
vi: Tên cột không được trùng nhau.
zh_hans: 列名必须唯一。
zh_hant: 欄位名稱必須是唯一的。
